app/controllers/import_files_controller.rb

INSERT INTO "products" ("category", "unity", "description", "code", "cost", "observations", "supplier", "barcode", "min_stock", "purchase_stock", "brand", "weight", "size", "current_state_id", "product_type", "composition", "raw_material", "office_supplies", "for_sale", "currency", "stock", "max_stock", "sale_price", "ipi", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
        end

        begin
          Product.create!(product_hash)