app/controllers/products_controller.rb

SELECT  "current_states".* FROM "current_states"  ORDER BY "current_states"."id" ASC LIMIT 1
---
  def new
    @product = Product.new
    @current_states = CurrentState.all

SELECT "current_states".* FROM "current_states"
---
  def edit
    @current_states = CurrentState.all

UPDATE "products" SET "barcode" = ?, "unity" = ?, "supplier" = ?, "brand" = ?, "size" = ?, "composition" = ?, "raw_material" = ?, "office_supplies" = ?, "for_sale" = ?, "currency" = ?, "observations" = ?, "category" = ?, "unity_factor" = ?, "gender" = ?, "updated_at" = ? WHERE "products"."id" = ?
---
  def update
    respond_to do |format|
      if @product.update(product_params)